// Напишите программу, которая принимает на вход координаты точки (X и Y), причем X != 0 и Y != 0 и выдает номер четверти плоскости, в которой находится эта точка.

// int Prompt(string message)
// {
//     Console.Write(message);
//     int number = int.Parse(Console.ReadLine());
//     return number;
// }

// void FindQuarter(int X, int Y)
// {
//     if (X > 0 && Y > 0)
//     {
//         Console.WriteLine("I четверть");
//     }
//     else if (X < 0 && Y > 0)
//     {
//         Console.WriteLine("II четверть");
//     }
//     else if (X < 0 && Y < 0)
//     {
//         Console.WriteLine("III четверть");
//     }
//     else if (X > 0 && Y < 0)
//     {
//         Console.WriteLine("IV четверть");
//     }
//     else{
//         Console.WriteLine("Ошибка");
//     }
// }

// int x = Prompt("Введите координату точки X: ");
// int y = Prompt("Введите координату точки Y: ");
// FindQuarter(x, y);


// Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве. A(3, 6); B(2, 1) -> 5,09  A(7, -5); B(1, -1) -> 7,21

